Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУказаниеКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвоиМагазины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагзиныПартнеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HQ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Франшиза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧасаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МеткиКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/HomeOfIngeneer/Ext/Module.bsl
Функция ВходПолучение(Запрос)
	яОтвет = Новый HTTPСервисОтвет(200);
	ITC_HTTPСервер.ДобавитьЗаголовкиОтвета(яОтвет);
	
	яКлюч = Запрос.ПараметрыЗапроса.Получить("skey");
	яКоманда = Запрос.ПараметрыЗапроса.Получить("command");
	Если яКоманда <> Неопределено Тогда
		Возврат ITC_МенеджерПакетов.Main(Запрос, яОтвет);
	ИначеЕсли яКлюч <> "i4FCrvii9Gl5SXTj9dwO2tW5smhJAfiO" Тогда
		яОтвет.КодСостояния = 401;
		яТело = "<html><body><h2>You are not Authorized!</h2></body></html>";
		яОтвет.УстановитьТелоИзСтроки(яТело, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат яОтвет;
	КонецЕсли;
	
	
	
	
	
	яТело = "<html>";
	ITC_HTTPСервер.ДобавитьТаблицуСтилей(яТело);
	ITC_HTTPСервер.ДобавитьЗаголовкиHead(яТело, "ITCrowd");
	яТело = яТело + "<body><h2>IT works perfect!</h2>";
//	|<meta http-equiv=""Cache-Control"" content=""no-cache"">
	
	яСайт="https://wiki.upra.tk/itc/hs/itc/";
	яКлиент = Запрос.ПараметрыЗапроса.Получить("c");
	яТипДанных = Запрос.ПараметрыЗапроса.Получить("t");
	
	
	
	
	Если яТипДанных = Неопределено Тогда
		
		ВывестиГлавноеМеню(яТело);
		
	ИначеЕсли яТипДанных = "i" Тогда
		
		Если яКлиент = Неопределено Тогда
			ВывестиСписокКонтрганетов(яТело);
		Иначе
			ВывестиИнформациюКонтрганета(яТело, яКлиент)
		КонецЕсли;
		
	Иначе
		
		ВывестиГлавноеМеню(яТело);
		
	КонецЕсли;
	
	
	
	яТело = яТело + "</body></html>";
	яОтвет.УстановитьТелоИзСтроки(яТело, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат яОтвет;
КонецФункции

Процедура ВывестиГлавноеМеню(ъТело)
	
	яя = ITC_HTTPСервер.ПолучитьСтруктуруСокращений();
	яТело =
	"<h3> Главное меню </h3><table class=""blueTable""><thead>
	|<tr><th>Имя</th></tr>
	|</thead><tbody>";
	яТело = яТело + яя.Н + "<a href=""?t=n"">Незакрытые наряды</a>" + яя.К;
	яТело = яТело + яя.Н + "<a href=""?t=i"">Информация по клиентам</a>" + яя.К;
	яТело = яТело + "</tbody></table>";
	
	ъТело = ъТело + яТело;
	
КонецПроцедуры

Процедура ВывестиСписокКонтрганетов(ъТело)
	
	яя = ITC_HTTPСервер.ПолучитьСтруктуруСокращений();
	
	яЗ = Новый Запрос(
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК С,
	|	Клиенты.Наименование КАК Им
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Им");
	яВ = яЗ.Выполнить().Выбрать();
	
	яСтрока = "<a href=""?t=i&c=";
	яНазад = "<a href=""?"">Назад</a>";
	
	яТело = "<h3> Список клиентов </h3>" + яНазад + "<table class=""blueTable""><thead>
	|<tr><th>Наименование</th></tr>
	|</thead><tbody>";
	Пока яВ.Следующий() Цикл
		яТело = яТело + яя.Н + яСтрока + Строка(яВ.С.УникальныйИдентификатор()) + """>" + яВ.Им + "</a>" + яя.К;
	КонецЦикла;
	яТело = яТело + "</tbody></table>" + яНазад;
	
	ъТело = ъТело + яТело;
	
КонецПроцедуры

Процедура ВывестиИнформациюКонтрганета(ъТело, ъСсылка)
	яНазад = "<a href=""?t=i"">Назад</a>";
	
	Если Не ЗначениеЗаполнено(ъСсылка) Тогда
		ъТело = ъТело + "<h3> Не указана ссылка на контрагента </h3>" + яНазад;
		Возврат;
	КонецЕсли;
	
	Попытка
		яУИ = Новый УникальныйИдентификатор(ъСсылка);
		яСсылка = Справочники.Клиенты.ПолучитьСсылку(яУИ);
	Исключение
		ъТело = ъТело + "<h3> Ошибка в указании ссылки на контрагента </h3>" + яНазад;
		Возврат;
	КонецПопытки;
	
	яя = ITC_HTTPСервер.ПолучитьСтруктуруСокращений();
	
	яЗ = Новый Запрос(
	"ВЫБРАТЬ
	|	Клиенты.НаименованиеПолное КАК Наименование,
	|	Клиенты.ИНН КАК ИНН,
	|	Клиенты.ОсновнаяОрганизация.Наименование КАК Организация,
	|	Клиенты.КонтактнаяИнформация.(
	|		Вид.Наименование КАК Т,
	|		Представление КАК П
	|	) КАК Контакты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Ссылка = &С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактныеЛица.Наименование КАК ФИО,
	|	КонтактныеЛица.ФизическоеЛицо.КонтактнаяИнформация.(
	|		Вид.Наименование КАК Т,
	|		Представление КАК П,
	|	) КАК КИ
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &С");
	яЗ.УстановитьПараметр("С", яСсылка);
	яРЗ = яЗ.ВыполнитьПакет();
	яТЗ = яРЗ[0].Выгрузить();
	
	яТело = "<h3> Информация по клиенту </h3>" + яНазад + "<table class=""blueTable""><thead>
	|<tr><th>Поле</th><th>Информация</th></tr>
	|</thead><tbody>";
	Для Каждого яИ Из яТЗ.Колонки Цикл
		Если яИ.Имя = "Контакты" Тогда
			яТело = яТело + яя.Н + яИ.Имя + яя.С;
			яТ = "";
			Для Каждого яИКИ Из яТЗ[0][яИ.Имя] Цикл
				яТ = яТ + ?(ПустаяСтрока(яТ),"","<br />") + яИКИ.Т + ": " + яИКИ.П;
			КонецЦикла;
			яТело = яТело + яТ + яя.К;
		Иначе
			яТело = яТело + яя.Н + яИ.Имя + яя.С + яТЗ[0][яИ.Имя] + яя.К;
		КонецЕсли;
	КонецЦикла;
	яТело = яТело + "</tbody></table>";
	
	яВ = яРЗ[1].Выбрать();
	Если яВ.Количество() Тогда
		яТело = яТело +"<h3> Контактные лица </h3><table class=""blueTable""><thead>
		|<tr><th>ФИО</th><th>Информация</th></tr>
		|</thead><tbody>";
		Пока яВ.Следующий() Цикл
			яТело = яТело + яя.Н + яВ.ФИО + яя.С;
			яТ = "";
			яВКИ = яВ.КИ.Выбрать();
			Пока яВКИ.Следующий() Цикл
				Если Не ПустаяСтрока(яВКИ.Т) Тогда
					яТ = яТ + ?(ПустаяСтрока(яТ),"","<br />") + яВКИ.Т + ": " + яВКИ.П;
				КонецЕсли;
			КонецЦикла;
			яТело = яТело + яТ + яя.К;
		КонецЦикла;
		яТело = яТело + "</tbody></table>";
	КонецЕсли;
	
	яТело = яТело + яНазад;
	
	ъТело = ъТело + яТело;
	
КонецПроцедуры
